Tekla Open API Reference for Tekla Structures 2025
View.GetVisibleAreaRestrictionBoxes Method
 Gets the restriction boxes that represent the visible areas of the view.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IEnumerator GetVisibleAreaRestrictionBoxes()
Public Function GetVisibleAreaRestrictionBoxes As IEnumerator
Return Value
Type: IEnumerator
The restriction boxes that repserent the visible areas of the view.
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace